Обработки/Reports/_РасчетДоходностиExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиExcel/Forms/Сбербанк/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЗаполнитьЗначенияСвойств(Отчет, Параметры);
	ШаблонExcel = РеквизитФормыВЗначение("Отчет").ПолучитьМакет(СтрРазделить(ЭтаФорма.ИмяФормы, ".")[3]); //Шаблон по имени формы
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет() Экспорт
	
	СформироватьНаСервере();
	
	ИмяФайлаШаблонаExcel = ПолучитьИмяВременногоФайла("xlt");

	ШаблонExcel.Записать(ИмяФайлаШаблонаExcel);
	
	// создадим документ MS Excel на основании сохраненного шаблона
	ExcelApp = Новый COMОбъект("Excel.Application");
	ExcelApp.Application.Visible = Ложь;
	
	ExcelApp.Application.Workbooks.Open(ИмяФайлаШаблонаExcel);
	
	ExcelApp.Cells(6, 1).Value = ЭтаФорма.НаименованиеОрганизации;
	ExcelApp.Cells(15,1).Value = ЭтаФорма.НаименованиеОрганизации;
	
	ExcelApp.Cells(1,27).Value = Год(Отчет.Период.ДатаНачала);
	ExcelApp.Cells(2,27).Value = НачалоДня(Отчет.Период.ДатаОкончания);

	ExcelApp.Cells(3,3).Value = ДеньГода(КонецГода(Отчет.Период.ДатаОкончания));
	
	ExcelApp.Cells(6,3).Value = ЭтаФорма.СтоимостиАктивов[0].БалансоваяСтоимость;
	ExcelApp.Cells(7,3).Value = ЭтаФорма.СтоимостиАктивов[0].РыночнаяСтоимость;

	ТекСтрока = 8;
	Для каждого СтрокаВводыВыводы Из ЭтаФорма.ВводыВыводы Цикл
		
		Если ТекСтрока > 8 Тогда
		
			ExcelApp.Cells(ТекСтрока, 2).Select();
			ExcelApp.Selection.EntireRow.Insert();
			
			ТСтр = СокрЛП(Строка(ТекСтрока));
			
			ExcelApp.Range("D"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(D$5="""";"""";ЕСЛИ($B"+ТСтр+"<=D$5;$C"+ТСтр+"/$C$3*(D$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("E"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(E$5="""";"""";ЕСЛИ($B"+ТСтр+"<=E$5;$C"+ТСтр+"/$C$3*(E$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("F"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(F$5="""";"""";ЕСЛИ($B"+ТСтр+"<=F$5;$C"+ТСтр+"/$C$3*(F$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("G"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(G$5="""";"""";ЕСЛИ($B"+ТСтр+"<=G$5;$C"+ТСтр+"/$C$3*(G$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("H"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(H$5="""";"""";ЕСЛИ($B"+ТСтр+"<=H$5;$C"+ТСтр+"/$C$3*(H$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("I"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(I$5="""";"""";ЕСЛИ($B"+ТСтр+"<=I$5;$C"+ТСтр+"/$C$3*(I$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("J"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(J$5="""";"""";ЕСЛИ($B"+ТСтр+"<=J$5;$C"+ТСтр+"/$C$3*(J$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("K"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(K$5="""";"""";ЕСЛИ($B"+ТСтр+"<=K$5;$C"+ТСтр+"/$C$3*(K$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("L"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(L$5="""";"""";ЕСЛИ($B"+ТСтр+"<=L$5;$C"+ТСтр+"/$C$3*(L$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("M"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(M$5="""";"""";ЕСЛИ($B"+ТСтр+"<=M$5;$C"+ТСтр+"/$C$3*(M$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("N"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(N$5="""";"""";ЕСЛИ($B"+ТСтр+"<=N$5;$C"+ТСтр+"/$C$3*(N$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("O"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(O$5="""";"""";ЕСЛИ($B"+ТСтр+"<=O$5;$C"+ТСтр+"/$C$3*(O$5-$B"+ТСтр+"+1);0))";
			
			ExcelApp.Range("P"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(P$5="""";"""";ЕСЛИ($B"+ТСтр+"<=P$5;$C"+ТСтр+"/$C$3*(P$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("Q"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(Q$5="""";"""";ЕСЛИ($B"+ТСтр+"<=Q$5;$C"+ТСтр+"/$C$3*(Q$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("R"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(R$5="""";"""";ЕСЛИ($B"+ТСтр+"<=R$5;$C"+ТСтр+"/$C$3*(R$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("S"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(S$5="""";"""";ЕСЛИ($B"+ТСтр+"<=S$5;$C"+ТСтр+"/$C$3*(S$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("T"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(T$5="""";"""";ЕСЛИ($B"+ТСтр+"<=T$5;$C"+ТСтр+"/$C$3*(T$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("U"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(U$5="""";"""";ЕСЛИ($B"+ТСтр+"<=U$5;$C"+ТСтр+"/$C$3*(U$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("V"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(V$5="""";"""";ЕСЛИ($B"+ТСтр+"<=V$5;$C"+ТСтр+"/$C$3*(V$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("W"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(W$5="""";"""";ЕСЛИ($B"+ТСтр+"<=W$5;$C"+ТСтр+"/$C$3*(W$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("X"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(X$5="""";"""";ЕСЛИ($B"+ТСтр+"<=X$5;$C"+ТСтр+"/$C$3*(X$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("Y"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(Y$5="""";"""";ЕСЛИ($B"+ТСтр+"<=Y$5;$C"+ТСтр+"/$C$3*(Y$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("Z"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(Z$5="""";"""";ЕСЛИ($B"+ТСтр+"<=Z$5;$C"+ТСтр+"/$C$3*(Z$5-$B"+ТСтр+"+1);0))";
			ExcelApp.Range("AA"+ТСтр).Select();
			ExcelApp.ActiveCell.FormulaLocal = "=ЕСЛИ(AA$5="""";"""";ЕСЛИ($B"+ТСтр+"<=AA$5;$C"+ТСтр+"/$C$3*(AA$5-$B"+ТСтр+"+1);0))";
			
		КонецЕсли;
		
		ExcelApp.Cells(ТекСтрока, 2).Value = НачалоДня(СтрокаВводыВыводы.Дата);
		ExcelApp.Cells(ТекСтрока, 3).Value = СтрокаВводыВыводы.Сумма;
		
		ТекСтрока = ТекСтрока + 1;
	
	КонецЦикла;
	
	Если ЭтаФорма.ВводыВыводы.Количество() = 0 Тогда
	
		ExcelApp.Cells(ТекСтрока, 2).Select();
		ExcelApp.Selection.EntireRow.Delete();
	
	КонецЕсли;
	
	ТСтр1 = СокрЛП(Строка(ТекСтрока - 1));
	
	ТСтр = СокрЛП(Строка(ТекСтрока));
	
	ExcelApp.Range("D"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(D7:D"+ТСтр1+")";
	ExcelApp.Range("E"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(E6:E"+ТСтр1+")";
	ExcelApp.Range("F"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(F7:F"+ТСтр1+")";
	ExcelApp.Range("G"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(G6:G"+ТСтр1+")";
	ExcelApp.Range("H"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(H7:H"+ТСтр1+")";
	ExcelApp.Range("I"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(I6:I"+ТСтр1+")";
	ExcelApp.Range("J"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(J7:J"+ТСтр1+")";
	ExcelApp.Range("K"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(K6:K"+ТСтр1+")";
	ExcelApp.Range("L"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(L7:L"+ТСтр1+")";
	ExcelApp.Range("M"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(M6:M"+ТСтр1+")";
	ExcelApp.Range("N"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(N7:N"+ТСтр1+")";
	ExcelApp.Range("O"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(O6:O"+ТСтр1+")";
	
	ExcelApp.Range("P"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(P7:P"+ТСтр1+")";
	ExcelApp.Range("Q"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(Q6:Q"+ТСтр1+")";
	ExcelApp.Range("R"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(R7:R"+ТСтр1+")";
	ExcelApp.Range("S"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(S6:S"+ТСтр1+")";
	ExcelApp.Range("T"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(T7:T"+ТСтр1+")";
	ExcelApp.Range("U"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(U6:U"+ТСтр1+")";
	ExcelApp.Range("V"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(V7:V"+ТСтр1+")";
	ExcelApp.Range("W"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(W6:W"+ТСтр1+")";
	ExcelApp.Range("X"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(X7:X"+ТСтр1+")";
	ExcelApp.Range("Y"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(Y6:Y"+ТСтр1+")";
	ExcelApp.Range("Z"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(Z7:Z"+ТСтр1+")";
	ExcelApp.Range("AA"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММ(AA6:AA"+ТСтр1+")";
	
	ТекСтрока = ТекСтрока + 1;
	
	ТСтр = СокрЛП(Строка(ТекСтрока));
	
	ExcelApp.Range("D"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&D$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("F"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&F$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("H"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&H$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("J"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&J$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("L"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&L$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("N"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&N$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("P"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&P$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("R"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&R$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("T"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&T$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("V"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&V$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("X"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&X$5;$C$7:$C$"+ТСтр1+")";
	ExcelApp.Range("Z"+ТСтр).Select();
	ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$7:$B$"+ТСтр1+";""<=""&Z$5;$C$7:$C$"+ТСтр1+")";

	Если ЭтаФорма.ВводыВыводы.Количество() = 0 Тогда
		
		ExcelApp.Range("E"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("G"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("I"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("K"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("M"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("O"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("Q"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("S"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("U"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("W"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("Y"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		ExcelApp.Range("AA"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=$C$6";
		
	Иначе
		
		ExcelApp.Range("E"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&E$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("G"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&G$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("I"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&I$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("K"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&K$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("M"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&M$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("O"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&O$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("Q"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&Q$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("S"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&S$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("U"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&U$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("W"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&W$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("Y"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&Y$5;$C$8:$C$"+ТСтр1+")+$C$6";
		ExcelApp.Range("AA"+ТСтр).Select();
		ExcelApp.ActiveCell.FormulaLocal = "=СУММЕСЛИ($B$8:$B$"+ТСтр1+";""<=""&AA$5;$C$8:$C$"+ТСтр1+")+$C$6";
		
	КонецЕсли;
	
	
	Инд = 4;
	Для каждого СтрокаСтоимостиАктивов Из ЭтаФорма.СтоимостиАктивов Цикл
		
		//первую строку пропускаем, там начальные остатки
		Если СтрокаСтоимостиАктивов.Дата < Отчет.Период.ДатаНачала Тогда
			Продолжить;
		КонецЕсли;
		
		ExcelApp.Cells(ТекСтрока+12, Инд).Value = СтрокаСтоимостиАктивов.БалансоваяСтоимость;
		ExcelApp.Cells(ТекСтрока+13, Инд).Value = СтрокаСтоимостиАктивов.РыночнаяСтоимость;
		ExcelApp.Cells(ТекСтрока+6, Инд).Value = СтрокаСтоимостиАктивов.ИнвестДоходПоБалансу;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаExcel);
	Исключение
	КонецПопытки;
	
	ExcelApp.Application.Visible = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
		
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Отчет, "Период,Организация,СчетДоверительногоУправления,Валюта", Новый Структура("ВариантОтчета", "Сбербанк"));
	Механизм = РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыОперацийПриВводеВыводеДенежныхСредств.Ссылка КАК ВидОперацииВводаВыводаДС
		|ПОМЕСТИТЬ ВидыОперацииВводаВыводаДС
		|ИЗ
		|	Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств КАК ВидыОперацийПриВводеВыводеДенежныхСредств
		|ГДЕ
		|	ВидыОперацийПриВводеВыводеДенежныхСредств.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводУчредителюДоходаПолученногоОтРазмещения), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ) КАК Дата,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ТОГДА ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость
		|			ИНАЧЕ -ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВводыВыводыАктивовВВалютеУчета.ВидОперацииВводаВыводаДС В
		|					(ВЫБРАТЬ
		|						ВидыОперацииВводаВыводаДС.ВидОперацииВводаВыводаДС КАК ВидОперацииВводаВыводаДС
		|					ИЗ
		|						ВидыОперацииВводаВыводаДС КАК ВидыОперацииВводаВыводаДС)
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	
	ЭтотОбъект.ВводыВыводы.Загрузить(Запрос.Выполнить().Выгрузить());

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказателиСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ КонцыМесяцев
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|			&НачалоПериода,
		|			СубъектАналитики = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(ФинансовыеПоказатели.Период)
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Период >= &НачалоПериода
		|	И ФинансовыеПоказатели.Период <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Период КАК Период,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -1),
		|			&КонецПериода,
		|			Месяц,
		|			ДвиженияИГраницыПериода,
		|			ПОДСТРОКА(Счет.Код, 1, 1) < ""7""
		|				И ПОДСТРОКА(Счет.Код, 1, 3) <> ""479"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Период,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -1),
		|			&КонецПериода,
		|			Месяц,
		|			ДвиженияИГраницыПериода,
		|			ПОДСТРОКА(Счет.Код, 1, 3) = ""479"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(СПРАВОЧНИК.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонцыМесяцев.Период КАК Период,
		|	МАКСИМУМ(Остатки.Период) КАК ПериодОстатков,
		|	Остатки.Счет КАК Счет
		|ПОМЕСТИТЬ ДатыОстатков
		|ИЗ
		|	КонцыМесяцев КАК КонцыМесяцев
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО КонцыМесяцев.Период >= Остатки.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	КонцыМесяцев.Период,
		|	Остатки.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДатыОстатков.Период, МЕСЯЦ), ДЕНЬ) КАК Дата,
		|	СУММА(Остатки.СуммаКонечныйОстаток) КАК БалансоваяСтоимость
		|ПОМЕСТИТЬ БалансовыеСтоимости
		|ИЗ
		|	ДатыОстатков КАК ДатыОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ДатыОстатков.ПериодОстатков = Остатки.Период
		|			И ДатыОстатков.Счет = Остатки.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатыОстатков.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(КонцыМесяцев.Период, МЕСЯЦ), ДЕНЬ) КАК Дата,
		|	ФинансовыеПоказатели.Значение КАК РыночнаяСтоимость
		|ПОМЕСТИТЬ РыночныеСтоимости
		|ИЗ
		|	КонцыМесяцев КАК КонцыМесяцев
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО КонцыМесяцев.Период = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(БалансовыеСтоимости.Дата, РыночныеСтоимости.Дата) КАК Дата,
		|	ЕСТЬNULL(БалансовыеСтоимости.БалансоваяСтоимость, 0) КАК БалансоваяСтоимость,
		|	ЕСТЬNULL(РыночныеСтоимости.РыночнаяСтоимость, 0) КАК РыночнаяСтоимость
		|ИЗ
		|	БалансовыеСтоимости КАК БалансовыеСтоимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ РыночныеСтоимости КАК РыночныеСтоимости
		|		ПО БалансовыеСтоимости.Дата = РыночныеСтоимости.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.Период.ДатаНачала) - 24 * 60 * 60);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	
	ЭтотОбъект.СтоимостиАктивов.Загрузить(Запрос.Выполнить().Выгрузить());
	ЗаполнитьИнвестДоходПоБалансу();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.НаименованиеОрганизации = Выборка.НаименованиеОрганизации;
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвестДоходПоБалансу()
	
	ОтчетОДоходахИРасходахНПФ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетОДоходахИРасходахНПФ");
	
	Для Каждого СтрокаСтоимостиАктивов Из ЭтотОбъект.СтоимостиАктивов Цикл
		Если СтрокаСтоимостиАктивов.Дата >= Отчет.Период.ДатаНачала Тогда
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			ОтчетОДоходахИРасходахНПФ.ВыполнитьЗапрос(
				Запрос, 
				Новый СтандартныйПериод(Отчет.Период.ДатаНачала, КонецДня(СтрокаСтоимостиАктивов.Дата)), 
				Отчет.Организация, 
				Отчет.СчетДоверительногоУправления);
				
			ТаблицаДоходовИРасходов = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаДоходовИРасходов").ПолучитьДанные().Выгрузить();
			СтрокаСтоимостиАктивов.ИнвестДоходПоБалансу = ТаблицаДоходовИРасходов.Итог("Итого");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
